src/cf/Enums/ВажностьПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВажностьПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВариантыВажностиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыВажностиОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВажностьПисем/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет вариант важности объектов по важности писем.
// 
// Параметры:
//  ВажностьПисем - ПеречислениеСсылка.ВажностьПисем
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВариантыВажностиОбъектов
// 
Функция ВариантВажностиОбъектов(ВажностьПисем) Экспорт
	
	Если ВажностьПисем = Высокая Тогда
		ВариантВажностиОбъектов = Перечисления.ВариантыВажностиОбъектов.Высокая;
	ИначеЕсли ВажностьПисем = Обычная Тогда
		ВариантВажностиОбъектов = Перечисления.ВариантыВажностиОбъектов.Обычная;
	ИначеЕсли ВажностьПисем = Низкая Тогда
		ВариантВажностиОбъектов = Перечисления.ВариантыВажностиОбъектов.Низкая;
	Иначе
		ВариантВажностиОбъектов = Перечисления.ВариантыВажностиОбъектов.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ВариантВажностиОбъектов;
	
КонецФункции

#КонецОбласти

#КонецЕсли
